andrewscherpbier/esp32-s3-display/common/sdkconfig.defaults
# Shared by every app for the LCDwiki / Hosyond ES3C35P: ESP32-S3R8 (8MB octal PSRAM), 16MB quad flash.
# Paths are relative to an app directory (apps/<name>).
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../common/partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Let Wi-Fi and lwIP buffers use PSRAM; LVGL's DMA draw buffers need the internal RAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Keep Wi-Fi code in flash: internal RAM is tight next to the LVGL buffers, and the
# throughput these IRAM options buy isn't needed here
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# The board's only USB port is the chip's native USB-Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_32=y
